# SQL Practice

This notebook is to strenghten the concepts found in DataCamp's [SQL Fundamentals](https://www.datacamp.com/tracks/sql-fundamentals) skill track.

## Setup

In [1]:
%load_ext sql
import os

conn_string='postgresql://postgres:123@localhost:5432/northwind'
%sql $conn_string

'Connected: postgres@northwind'

I've set up a [PostgreSQL](https://www.postgresql.org/) instance at [Docker](https://www.docker.com/) for practice, loading the [Northwind](https://docs.yugabyte.com/latest/sample-data/northwind/) database (an example database found in SQL Server docs).

## Overview

The table has the following relationship diagram:
![image](https://blog.yugabyte.com/wp-content/uploads/2019/07/northwind_distributedsql-06.png)

In [3]:
%%sql
SELECT table_schema, table_name
FROM information_schema.tables
WHERE table_schema NOT IN ('pg_catalog','information_schema')
AND table_type = 'BASE TABLE'
;

 * postgresql://postgres:***@localhost:5432/northwind
14 rows affected.

[('public', 'customer_demographics'),
 ('public', 'customer_customer_demo'),
 ('public', 'customers'),
 ('public', 'employees'),
 ('public', 'categories'),
 ('public', 'products'),
 ('public', 'suppliers'),
 ('public', 'orders'),
 ('public', 'shippers'),
 ('public', 'region'),
 ('public', 'territories'),
 ('public', 'employee_territories'),
 ('public', 'order_details'),
 ('public', 'us_states')]

# Basic queries

In [6]:
%%sql
-- List of customers
SELECT *
FROM customers
LIMIT 5
;

 * postgresql://postgres:***@localhost:5432/northwind
5 rows affected.

[('ALFKI', 'Alfreds Futterkiste', 'Maria Anders', 'Sales Representative', 'Obere Str. 57', 'Berlin', None, '12209', 'Germany', '030-0074321', '030-0076545'),
 ('ANATR', 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Owner', 'Avda. de la Constitución 2222', 'México D.F.', None, '05021', 'Mexico', '(5) 555-4729', '(5) 555-3745'),
 ('ANTON', 'Antonio Moreno Taquería', 'Antonio Moreno', 'Owner', 'Mataderos  2312', 'México D.F.', None, '05023', 'Mexico', '(5) 555-3932', None),
 ('AROUT', 'Around the Horn', 'Thomas Hardy', 'Sales Representative', '120 Hanover Sq.', 'London', None, 'WA1 1DP', 'UK', '(171) 555-7788', '(171) 555-6750'),
 ('BERGS', 'Berglunds snabbköp', 'Christina Berglund', 'Order Administrator', 'Berguvsvägen  8', 'Luleå', None, 'S-958 22', 'Sweden', '0921-12 34 65', '0921-12 34 67')]

In [7]:
%%sql
-- List of products
SELECT *
FROM products
LIMIT 5
;

 * postgresql://postgres:***@localhost:5432/northwind
5 rows affected.

[(1, 'Chai', 8, 1, '10 boxes x 30 bags', 18.0, 39, 0, 10, 1),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19.0, 17, 40, 25, 1),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10.0, 13, 70, 25, 0),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22.0, 53, 0, 0, 0),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21.35, 0, 0, 0, 1)]

In [12]:
%%sql
--Filtered list of products
SELECT *
FROM products
WHERE unit_price > 20
AND product_name LIKE '%Chef%'
LIMIT 5
;

 * postgresql://postgres:***@localhost:5432/northwind
2 rows affected.

[(4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22.0, 53, 0, 0, 0),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21.35, 0, 0, 0, 1)]

# Joins

In [18]:
%%sql
-- Quantity of orders by customer
SELECT
    c.contact_name as customer,
    COUNT(o.order_id) as orders
FROM orders o
INNER JOIN customers c
ON o.customer_id = c.customer_id
GROUP BY c.contact_name
ORDER BY orders DESC
LIMIT 5
;

 * postgresql://postgres:***@localhost:5432/northwind
5 rows affected.

[('Jose Pavarotti', 31),
 ('Roland Mendel', 30),
 ('Horst Kloss', 28),
 ('Patricia McKenna', 19),
 ('Maria Larsson', 19)]

In [31]:
%%sql
--Top sellers by orders
SELECT
    CONCAT(e.first_name, ' ', e.last_name) as employee,
    COUNT(o.order_id) as orders,
    SUM(od.quantity*(od.unit_price-od.discount)) as order_total
FROM order_details od
INNER JOIN orders as o
ON od.order_id = o.order_id
RIGHT JOIN employees as e
ON o.employee_id = e.employee_id
GROUP BY employee
ORDER BY order_total DESC
LIMIT 10
;

 * postgresql://postgres:***@localhost:5432/northwind
9 rows affected.

[('Margaret Peacock', 420, 249480.80001616478),
 ('Janet Leverling', 321, 212636.34934663773),
 ('Nancy Davolio', 345, 201667.70072460175),
 ('Andrew Fuller', 241, 177378.66105222702),
 ('Robert King', 176, 140884.49038171768),
 ('Laura Callahan', 260, 133003.63001012802),
 ('Anne Dodsworth', 107, 82740.14948534966),
 ('Michael Suyama', 168, 78000.14963817596),
 ('Steven Buchanan', 117, 75344.70025348663)]

# Set theory and logic

## UNION and INTERSECT

In [55]:
%%sql
--Appends queries with UNION.
SELECT *
FROM products
WHERE supplier_id = 1
UNION
SELECT *
FROM products
WHERE supplier_id = 2
;

 * postgresql://postgres:***@localhost:5432/northwind
6 rows affected.

[(66, 'Louisiana Hot Spiced Okra', 2, 2, '24 - 8 oz jars', 17.0, 4, 100, 20, 0),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19.0, 17, 40, 25, 1),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10.0, 13, 70, 25, 0),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22.0, 53, 0, 0, 0),
 (65, 'Louisiana Fiery Hot Pepper Sauce', 2, 2, '32 - 8 oz bottles', 21.05, 76, 0, 0, 0),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21.35, 0, 0, 0, 1)]

In [54]:
%%sql
--The intersection of non-common rows should be empty.
SELECT *
FROM products
WHERE supplier_id = 1
INTERSECT
SELECT *
FROM products
WHERE supplier_id = 2
;

 * postgresql://postgres:***@localhost:5432/northwind
0 rows affected.

[]

## CASE statements

In [40]:
%%sql
--Find missing products
SELECT
    product_name,
    CASE WHEN units_in_stock > 0 THEN TRUE ELSE FALSE END as available,
    reorder_level
FROM products
LIMIT 10
;

 * postgresql://postgres:***@localhost:5432/northwind
10 rows affected.

[('Chai', True, 10),
 ('Chang', True, 25),
 ('Aniseed Syrup', True, 25),
 ("Chef Anton's Cajun Seasoning", True, 0),
 ("Chef Anton's Gumbo Mix", False, 0),
 ("Grandma's Boysenberry Spread", True, 25),
 ("Uncle Bob's Organic Dried Pears", True, 10),
 ('Northwoods Cranberry Sauce', True, 0),
 ('Mishi Kobe Niku', True, 0),
 ('Ikura', True, 0)]

# Subqueries
Subqueries can appear at SELECT, FROM, WHERE clauses, and nested within other subqueries.

In [45]:
%%sql
--Products by London suppliers
SELECT
    product_name,
    unit_price
FROM products
WHERE supplier_id IN
    (SELECT supplier_id
    FROM suppliers
    WHERE city = 'London')
;

 * postgresql://postgres:***@localhost:5432/northwind
2 rows affected.

[('Chang', 19.0), ('Aniseed Syrup', 10.0)]

## Correlated subqueries

In [72]:
%%sql
--The same result as earlier, but without explicit joins
SELECT
    c.contact_name,
    (SELECT
        COUNT(o.order_id) as orders
        FROM orders o
        WHERE o.customer_id = c.customer_id
    )
FROM customers c
ORDER BY orders DESC
LIMIT 5
;

 * postgresql://postgres:***@localhost:5432/northwind
5 rows affected.

[('Jose Pavarotti', 31),
 ('Roland Mendel', 30),
 ('Horst Kloss', 28),
 ('Maria Larsson', 19),
 ('Patricia McKenna', 19)]

# Common table expressions

In [82]:
%%sql
-- Expressions to find employees with more than 10 orders in a month
WITH employees_names AS (
    SELECT
        e.employee_id,
        CONCAT(e.first_name, ' ', e.last_name) as full_name
    FROM employees e
)

SELECT
    EXTRACT(year from o.order_date) as year,
    EXTRACT(month from o.order_date) as month,
    en.full_name,
    COUNT(o.order_id) as orders
FROM employees_names en
LEFT JOIN orders o
ON en.employee_id = o.employee_id
GROUP BY full_name, year, month
HAVING COUNT(o.order_id) > 10
;

 * postgresql://postgres:***@localhost:5432/northwind
7 rows affected.

[(1998.0, 4.0, 'Andrew Fuller', 18),
 (1997.0, 12.0, 'Janet Leverling', 11),
 (1998.0, 3.0, 'Nancy Davolio', 11),
 (1998.0, 3.0, 'Janet Leverling', 12),
 (1997.0, 8.0, 'Margaret Peacock', 11),
 (1998.0, 2.0, 'Margaret Peacock', 14),
 (1998.0, 3.0, 'Margaret Peacock', 12)]

In [127]:
%%sql
-- Find the employee of the month
WITH employees_names AS (
    SELECT
        e.employee_id,
        CONCAT(e.first_name, ' ', e.last_name) as full_name
    FROM employees e
),

monthly_orders AS (
    SELECT
        EXTRACT(year from o.order_date) as year,
        EXTRACT(month from o.order_date) as month,
        en.full_name,
        COUNT(o.order_id) as orders
    FROM employees_names en
    LEFT JOIN orders o
    ON en.employee_id = o.employee_id
    GROUP BY full_name, year, month
    --HAVING COUNT(o.order_id) > 10
)

SELECT
    year,
    month,
    full_name
FROM (
    SELECT
        year,
        month,
        full_name,
        orders,
        DENSE_RANK() OVER(PARTITION BY year, month ORDER BY orders DESC) as ranking
    FROM monthly_orders
    GROUP BY year, month, full_name, orders
) as sub
WHERE ranking = 1
;

 * postgresql://postgres:***@localhost:5432/northwind
31 rows affected.

[(1996.0, 7.0, 'Margaret Peacock'),
 (1996.0, 8.0, 'Laura Callahan'),
 (1996.0, 9.0, 'Andrew Fuller'),
 (1996.0, 9.0, 'Nancy Davolio'),
 (1996.0, 10.0, 'Margaret Peacock'),
 (1996.0, 11.0, 'Margaret Peacock'),
 (1996.0, 12.0, 'Nancy Davolio'),
 (1997.0, 1.0, 'Margaret Peacock'),
 (1997.0, 2.0, 'Janet Leverling'),
 (1997.0, 3.0, 'Laura Callahan'),
 (1997.0, 4.0, 'Margaret Peacock'),
 (1997.0, 5.0, 'Nancy Davolio'),
 (1997.0, 5.0, 'Robert King'),
 (1997.0, 5.0, 'Margaret Peacock'),
 (1997.0, 5.0, 'Janet Leverling'),
 (1997.0, 6.0, 'Janet Leverling'),
 (1997.0, 7.0, 'Nancy Davolio'),
 (1997.0, 8.0, 'Margaret Peacock'),
 (1997.0, 9.0, 'Nancy Davolio'),
 (1997.0, 10.0, 'Laura Callahan'),
 (1997.0, 10.0, 'Margaret Peacock'),
 (1997.0, 10.0, 'Nancy Davolio'),
 (1997.0, 10.0, 'Janet Leverling'),
 (1997.0, 11.0, 'Janet Leverling'),
 (1997.0, 12.0, 'Janet Leverling'),
 (1998.0, 1.0, 'Janet Leverling'),
 (1998.0, 2.0, 'Margaret Peacock'),
 (1998.0, 3.0, 'Margaret Peacock'),
 (1998.0, 3.0, 'Janet Leverling'),
 (1998.0, 4.0, 'Andrew Fuller'),
 (1998.0, 5.0, 'Nancy Davolio')]

# Window functions

In [77]:
%%sql
-- RANK to find most expensive freights
SELECT
    order_id,
    order_date,
    freight,
    RANK() OVER(ORDER BY freight DESC)
FROM orders
LIMIT 5
;

 * postgresql://postgres:***@localhost:5432/northwind
5 rows affected.

[(10540, datetime.date(1997, 5, 19), 1007.64, 1),
 (10372, datetime.date(1996, 12, 4), 890.78, 2),
 (11030, datetime.date(1998, 4, 17), 830.75, 3),
 (10691, datetime.date(1997, 10, 3), 810.05, 4),
 (10514, datetime.date(1997, 4, 22), 789.95, 5)]

In [26]:
%%sql
--Top countries by order counts, monthly
SELECT DISTINCT
    EXTRACT(year from o.order_date) as year,
    EXTRACT(month from o.order_date) as month,
    c.country,
    COUNT(o.order_id) OVER(PARTITION BY c.country) as orders
FROM customers c
INNER JOIN orders o
ON c.customer_id = o.customer_id
ORDER BY year, month
LIMIT 10
;

 * postgresql://postgres:***@localhost:5432/northwind
10 rows affected.

[(1996.0, 7.0, 'Austria', 40),
 (1996.0, 7.0, 'Belgium', 19),
 (1996.0, 7.0, 'Brazil', 83),
 (1996.0, 7.0, 'Finland', 22),
 (1996.0, 7.0, 'France', 77),
 (1996.0, 7.0, 'Germany', 122),
 (1996.0, 7.0, 'Mexico', 28),
 (1996.0, 7.0, 'Sweden', 37),
 (1996.0, 7.0, 'Switzerland', 18),
 (1996.0, 7.0, 'USA', 122)]

## Sliding windows

In [147]:
%%sql
--Daily running total of orders
SELECT
    o.order_date,
    SUM(o.order_id) OVER(
        ORDER BY o.order_date
        ROWS BETWEEN 1 PRECEDING AND CURRENT ROW
    ) as orders
FROM customers c
INNER JOIN orders o
ON c.customer_id = o.customer_id
LIMIT 10

 * postgresql://postgres:***@localhost:5432/northwind
10 rows affected.

[(datetime.date(1996, 7, 4), 10248),
 (datetime.date(1996, 7, 5), 20497),
 (datetime.date(1996, 7, 8), 20499),
 (datetime.date(1996, 7, 8), 20501),
 (datetime.date(1996, 7, 9), 20503),
 (datetime.date(1996, 7, 10), 20505),
 (datetime.date(1996, 7, 11), 20507),
 (datetime.date(1996, 7, 12), 20509),
 (datetime.date(1996, 7, 15), 20511),
 (datetime.date(1996, 7, 16), 20513)]

# Pivoting

First: preparing the table

In [162]:
%%sql
--Top suppliers by year

WITH supplier_sales AS (
    SELECT
        s.company_name as company,
        EXTRACT(year from o.order_date)::text as year,
        SUM(od.quantity) as items
    FROM suppliers s
    INNER JOIN products as p
    ON s.supplier_id = p.supplier_id
    INNER JOIN order_details od
    ON p.product_id = od.product_id
    INNER JOIN orders o
    ON od.order_id = o.order_id
    GROUP BY year, s.company_name
    ORDER BY items DESC
)

SELECT
    *
FROM supplier_sales
LIMIT 5
;

 * postgresql://postgres:***@localhost:5432/northwind
5 rows affected.

[('Plutzer Lebensmittelgroßmärkte AG', '1997', 1992),
 ('Pavlova, Ltd.', '1997', 1982),
 ('Specialty Biscuits, Ltd.', '1997', 1772),
 ('Plutzer Lebensmittelgroßmärkte AG', '1998', 1515),
 ('Gai pâturage', '1997', 1417)]

In [168]:
%%sql
--Top suppliers by year

CREATE EXTENSION IF NOT EXISTS tablefunc;

SELECT * FROM CROSSTAB($$
    SELECT
        s.company_name as company,
        EXTRACT(year from o.order_date)::text as year,
        SUM(od.quantity)::integer as items
    FROM suppliers s
    INNER JOIN products as p
    ON s.supplier_id = p.supplier_id
    INNER JOIN order_details od
    ON p.product_id = od.product_id
    INNER JOIN orders o
    ON od.order_id = o.order_id
    GROUP BY year, s.company_name;
$$) AS ct(
    company VARCHAR,
    "1996" INTEGER,
    "1997" INTEGER,
    "1998" INTEGER
)

 * postgresql://postgres:***@localhost:5432/northwind
Done.
85 rows affected.

[("Forêts d'érables", 558, None, None),
 ('Nord-Ost-Fisch Handelsgesellschaft mbH', 264, None, None),
 ('Zaanse Snoepfabriek', 489, None, None),
 ('Pavlova, Ltd.', 1098, None, None),
 ('New England Seafood Cannery', 1145, None, None),
 ('Norske Meierier', 679, None, None),
 ("G'day, Mate", 520, None, None),
 ('Nord-Ost-Fisch Handelsgesellschaft mbH', 152, None, None),
 ('Ma Maison', 382, None, None),
 ('Refrescos Americanas LTDA', 546, None, None),
 ('Plutzer Lebensmittelgroßmärkte AG', 1992, None, None),
 ('Gai pâturage', 1417, None, None),
 ('Specialty Biscuits, Ltd.', 543, None, None),
 ('PB Knäckebröd AB', 111, None, None),
 ('Norske Meierier', 1240, None, None),
 ("Grandma Kelly's Homestead", 201, None, None),
 ('Formaggi Fortini s.r.l.', 637, None, None),
 ("Cooperativa de Quesos 'Las Cabras'", 610, None, None),
 ('Exotic Liquids', 256, None, None),
 ('Lyngbysild', 262, None, None),
 ("Forêts d'érables", 250, None, None),
 ('Formaggi Fortini s.r.l.', 1107, None, None),
 ("G'day, Mate", 422, None, None),
 ('Heli Süßwaren GmbH & Co. KG', 794, None, None),
 ('Escargots Nouveaux', 202, None, None),
 ('Leka Trading', 311, None, None),
 ('PB Knäckebröd AB', 496, None, None),
 ('Ma Maison', 913, None, None),
 ('Specialty Biscuits, Ltd.', 1772, None, None),
 ('Plutzer Lebensmittelgroßmärkte AG', 1515, None, None),
 ('New England Seafood Cannery', 318, None, None),
 ("Grandma Kelly's Homestead", 697, None, None),
 ('Plutzer Lebensmittelgroßmärkte AG', 565, None, None),
 ('Nord-Ost-Fisch Handelsgesellschaft mbH', 196, None, None),
 ("Cooperativa de Quesos 'Las Cabras'", 318, None, None),
 ('Escargots Nouveaux', 155, None, None),
 ('Ma Maison', 363, None, None),
 ('Bigfoot Breweries', 622, None, None),
 ('Leka Trading', 1105, None, None),
 ('Pasta Buttini s.r.l.', 373, None, None),
 ('Aux joyeux ecclésiastiques', 406, None, None),
 ('Karkki Oy', 660, None, None),
 ('Gai pâturage', 1055, None, None),
 ('Escargots Nouveaux', 177, None, None),
 ('Refrescos Americanas LTDA', 421, None, None),
 ('Heli Süßwaren GmbH & Co. KG', 271, 371, None),
 ("Mayumi's", 680, None, None),
 ('Specialty Biscuits, Ltd.', 1364, None, None),
 ("G'day, Mate", 1166, None, None),
 ('Lyngbysild', 133, None, None),
 ("Forêts d'érables", 878, None, None),
 ('Norske Meierier', 607, None, None),
 ('Tokyo Traders', 354, None, None),
 ('Svensk Sjöföda AB', 247, None, None),
 ('Exotic Liquids', 625, None, None),
 ('Zaanse Snoepfabriek', 16, None, None),
 ('New Orleans Cajun Delights', 333, None, None),
 ('Tokyo Traders', 554, None, None),
 ('Bigfoot Breweries', 582, None, None),
 ('Svensk Sjöföda AB', 662, None, None),
 ('Pavlova, Ltd.', 1982, None, None),
 ('Pasta Buttini s.r.l.', 1095, None, None),
 ('Formaggi Fortini s.r.l.', 756, None, None),
 ('Aux joyeux ecclésiastiques', 506, None, None),
 ("Cooperativa de Quesos 'Las Cabras'", 122, None, None),
 ('Karkki Oy', 780, None, None),
 ('Exotic Liquids', 504, None, None),
 ("Mayumi's", 200, None, None),
 ('Refrescos Americanas LTDA', 158, None, None),
 ('Pavlova, Ltd.', 857, None, None),
 ('Pasta Buttini s.r.l.', 229, None, None),
 ('Gai pâturage', 601, None, None),
 ('Tokyo Traders', 226, None, None),
 ('Karkki Oy', 296, None, None),
 ('New Orleans Cajun Delights', 421, 981, None),
 ('PB Knäckebröd AB', 321, None, None),
 ('Aux joyeux ecclésiastiques', 504, None, None),
 ("Grandma Kelly's Homestead", 538, None, None),
 ('Lyngbysild', 661, None, None),
 ('Leka Trading', 462, None, None),
 ("Mayumi's", 537, None, None),
 ('Bigfoot Breweries', 369, None, None),
 ('Zaanse Snoepfabriek', 118, None, None),
 ('New England Seafood Cannery', 621, None, None),
 ('Svensk Sjöföda AB', 314, None, None)]

# Additional functions

## Date and time

In [187]:
%%sql

SELECT
    employee_id,
    first_name,
    birth_date,
    EXTRACT(year from AGE(CAST(birth_date as date)))::integer as age
FROM employees
;

 * postgresql://postgres:***@localhost:5432/northwind
9 rows affected.

[(2, 'Andrew', datetime.date(1952, 2, 19), 68),
 (3, 'Janet', datetime.date(1963, 8, 30), 56),
 (4, 'Margaret', datetime.date(1937, 9, 19), 82),
 (5, 'Steven', datetime.date(1955, 3, 4), 65),
 (6, 'Michael', datetime.date(1963, 7, 2), 56),
 (7, 'Robert', datetime.date(1960, 5, 29), 59),
 (8, 'Laura', datetime.date(1958, 1, 9), 62),
 (9, 'Anne', datetime.date(1966, 1, 27), 54),
 (1, 'Nancy', datetime.date(1948, 12, 8), 71)]

In [201]:
%%sql
-- Analyze shipment times
SELECT
    order_id,
    order_date,
    required_date,
    shipped_date,
    AGE(required_date, order_date) as sla,
    CASE WHEN required_date > shipped_date THEN 'Early'
    WHEN required_date = shipped_date THEN 'On time'
    ELSE 'Late' END AS schedule
FROM orders
LIMIT 10
;

 * postgresql://postgres:***@localhost:5432/northwind
10 rows affected.

[(10248, datetime.date(1996, 7, 4), datetime.date(1996, 8, 1), datetime.date(1996, 7, 16), datetime.timedelta(days=28), 'Early'),
 (10249, datetime.date(1996, 7, 5), datetime.date(1996, 8, 16), datetime.date(1996, 7, 10), datetime.timedelta(days=41), 'Early'),
 (10250, datetime.date(1996, 7, 8), datetime.date(1996, 8, 5), datetime.date(1996, 7, 12), datetime.timedelta(days=28), 'Early'),
 (10251, datetime.date(1996, 7, 8), datetime.date(1996, 8, 5), datetime.date(1996, 7, 15), datetime.timedelta(days=28), 'Early'),
 (10252, datetime.date(1996, 7, 9), datetime.date(1996, 8, 6), datetime.date(1996, 7, 11), datetime.timedelta(days=28), 'Early'),
 (10253, datetime.date(1996, 7, 10), datetime.date(1996, 7, 24), datetime.date(1996, 7, 16), datetime.timedelta(days=14), 'Early'),
 (10254, datetime.date(1996, 7, 11), datetime.date(1996, 8, 8), datetime.date(1996, 7, 23), datetime.timedelta(days=28), 'Early'),
 (10255, datetime.date(1996, 7, 12), datetime.date(1996, 8, 9), datetime.date(1996, 7, 15), datetime.timedelta(days=28), 'Early'),
 (10256, datetime.date(1996, 7, 15), datetime.date(1996, 8, 12), datetime.date(1996, 7, 17), datetime.timedelta(days=28), 'Early'),
 (10257, datetime.date(1996, 7, 16), datetime.date(1996, 8, 13), datetime.date(1996, 7, 22), datetime.timedelta(days=28), 'Early')]

## Text operations

In [207]:
%%sql

SELECT
    company_name,
    UPPER(company_name),
    REPLACE(company_name, 'Ltd.', 'Inc.'),
    REVERSE(company_name)
FROM suppliers
LIMIT 10
;

 * postgresql://postgres:***@localhost:5432/northwind
10 rows affected.

[('Exotic Liquids', 'EXOTIC LIQUIDS', 'Exotic Liquids', 'sdiuqiL citoxE'),
 ('New Orleans Cajun Delights', 'NEW ORLEANS CAJUN DELIGHTS', 'New Orleans Cajun Delights', 'sthgileD nujaC snaelrO weN'),
 ("Grandma Kelly's Homestead", "GRANDMA KELLY'S HOMESTEAD", "Grandma Kelly's Homestead", "daetsemoH s'ylleK amdnarG"),
 ('Tokyo Traders', 'TOKYO TRADERS', 'Tokyo Traders', 'sredarT oykoT'),
 ("Cooperativa de Quesos 'Las Cabras'", "COOPERATIVA DE QUESOS 'LAS CABRAS'", "Cooperativa de Quesos 'Las Cabras'", "'sarbaC saL' soseuQ ed avitarepooC"),
 ("Mayumi's", "MAYUMI'S", "Mayumi's", "s'imuyaM"),
 ('Pavlova, Ltd.', 'PAVLOVA, LTD.', 'Pavlova, Inc.', '.dtL ,avolvaP'),
 ('Specialty Biscuits, Ltd.', 'SPECIALTY BISCUITS, LTD.', 'Specialty Biscuits, Inc.', '.dtL ,stiucsiB ytlaicepS'),
 ('PB Knäckebröd AB', 'PB KNÄCKEBRÖD AB', 'PB Knäckebröd AB', 'BA dörbekcänK BP'),
 ('Refrescos Americanas LTDA', 'REFRESCOS AMERICANAS LTDA', 'Refrescos Americanas LTDA', 'ADTL sanaciremA socserfeR')]

In [222]:
%%sql

SELECT
    company_name,
    phone,
    LENGTH(phone),
    POSITION('-' in phone),
    SUBSTRING(phone FROM POSITION('(' in phone) FOR POSITION(')' in phone)) --get area code
FROM suppliers
LIMIT 10
;

 * postgresql://postgres:***@localhost:5432/northwind
10 rows affected.

[('Exotic Liquids', '(171) 555-2222', 14, 10, '(171)'),
 ('New Orleans Cajun Delights', '(100) 555-4822', 14, 10, '(100)'),
 ("Grandma Kelly's Homestead", '(313) 555-5735', 14, 10, '(313)'),
 ('Tokyo Traders', '(03) 3555-5011', 14, 10, '(03)'),
 ("Cooperativa de Quesos 'Las Cabras'", '(98) 598 76 54', 14, 0, '(98)'),
 ("Mayumi's", '(06) 431-7877', 13, 9, '(06)'),
 ('Pavlova, Ltd.', '(03) 444-2343', 13, 9, '(03)'),
 ('Specialty Biscuits, Ltd.', '(161) 555-4448', 14, 10, '(161)'),
 ('PB Knäckebröd AB', '031-987 65 43', 13, 4, ''),
 ('Refrescos Americanas LTDA', '(11) 555 4640', 13, 0, '(11)')]